In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex1.csv")
dataset.head()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [3]:
dataset1 = pd.read_table("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/test.tsv")
dataset1.head()

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

## Trying to read TSV data using read_csv

In [4]:
#dataset2 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/test.tsv")
# when i use the above line it reads the file as if it is a CSV hence we are not getting the data in good format
dataset2 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/test.tsv",sep='\t')
#In the above line you can see that i have overidden the default delimeter saying sep = '\t'
dataset2

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

## I don't want my first row to be the header then use header = none

In [5]:
dataset3 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex2.csv",header = None)
dataset3

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

## To give your own column names for the datatset

In [6]:
dataset4 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex2.csv",names = ["one","two","three","four","five","six"])
dataset4

   one  two  three  four   five  six
0    1    2      3     4  hello  NaN
1    5    6      7     8  world  NaN
2    9   10     11    12    foo  NaN

## index_col just to make multilabel indexing

In [7]:
dataset5 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/csv_mindex.csv")
dataset5

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [8]:
multilabelindex = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/csv_mindex.csv",
                             index_col=['key1','key2'])
multilabelindex
## as you can see the below and above output the below one looks more clear and it is also easy to read

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

## Skip some of the rows because it doesn't make any sense about the data and looks bad

In [9]:
NotskippedRows = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex4.csv")
NotskippedRows

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [10]:
skippedRows = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex4.csv",skiprows=[0,2,3])
skippedRows
# we can see the above and below data and there is a lot of difference between both of them.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## This is to find where the null values are located in the dataset

In [11]:
normalData = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex5.csv")
normalData

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [12]:
df = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex5.csv")
pd.isnull(df)
## so in the below output we can see where there are null values in the dataset there the value will be true and 
# where the values are not null there it is false.

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

## how to read data from excel and how to get data from a particular sheet in excel workbook

In [13]:
df1 = pd.read_excel("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/Book1.xlsx")
df1
# here i am reading the whole excel data and it will get me the data in the first sheet

   a  b  c  d
0  1  3  5  7
1  2  4  6  8

In [14]:
# this code helps me to get only the data that is present in the second sheet
df2 = pd.read_excel("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/Book1.xlsx",sheet_name='example_sheet')
df2

   asdas  as   da asd as.1 da.1
0  asdas   s    s   s    s    s
1      s  ss  NaN   s    s    s

## reading the data using the URL's

In [15]:
pip install lxml

Requirement already satisfied: lxml in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (4.9.2)
Note: you may need to restart the kernel to use updated packages.

In [22]:
url = 'https://en.wikipedia.org/wiki/List_of_countries_by_population_(United_Nations)'
df_list = pd.read_html(url)
# so whenever pandas reads a html url from the web it will take all the tables present in the url and make them into
# dataframes and it will combine all the dataframes into a list.
df4 = df_list[0]
df4.head()

,Country / Area,UN continental region[4],UN statistical subregion[4],Population (1 July 2022),Population (1 July 2023),Change
0,China[a],Asia,Eastern Asia,1425887337,1425671352,−0.02%
1,India,Asia,Southern Asia,1417173173,1428627663,+0.81%
2,United States,Americas,Northern America,338289857,339996564,+0.50%
3,Indonesia,Asia,South-eastern Asia,275501339,277534123,+0.74%
4,Pakistan,Asia,Southern Asia,235824863,240485658,+1.98%

## This code is used to read a single column

In [27]:
df4['Country / Area']

0                               China[a]
1                                  India
2                          United States
3                              Indonesia
4                               Pakistan
                     ...
232          Montserrat (United Kingdom)
233    Falkland Islands (United Kingdom)
234                                 Niue
235                Tokelau (New Zealand)
236                                World
Name: Country / Area, Length: 237, dtype: object

## This code is used to read multiple columns at a time

In [25]:
df4[['Country / Area','UN continental region[4]']]

                        Country / Area UN continental region[4]
0                             China[a]                     Asia
1                                India                     Asia
2                        United States                 Americas
3                            Indonesia                     Asia
4                             Pakistan                     Asia
..                                 ...                      ...
232        Montserrat (United Kingdom)                 Americas
233  Falkland Islands (United Kingdom)                 Americas
234                               Niue                  Oceania
235              Tokelau (New Zealand)                  Oceania
236                              World                      NaN

[237 rows x 2 columns]